Public Attributes | List of all members
ACAPI::MEP::FlexibleSegmentPolylineLinePart Struct Reference
MEP Element Manager
Defines a single line segment of a polyline FlexibleSegment. More...
#include <MEPTypes.hpp>
 Public Attributes
 API_Coord3D  | begin
World coordinate of starting point of the line.
 API_Coord3D  | end
World coordinate of ending point of the line.
Detailed Description
Defines a single line segment of a polyline FlexibleSegment.